<?php

//Loops/TaskSeven.php

//Напишете цикли, които извеждат "триъгълници на Флойд" с 5, 10 и 21 реда. 


//Триъгълник на Флойд с 5 реда

//Определяне на броя редове
    for($i=1; $i<=5; $i++){
        $number = 1;// дефинира числото, което е в начало на триъгълника
        
//Определя колко числа ще се изпишат на един ред взависимост от стойността на $i
       for($j=1; $j<=$i; $j++) { 
           echo $number++. '';//след всяка итерация числото се инкрементира с 1
       }
       echo '</br>';
    }


   //Триъгълник на Флойд с 10 реда
     for($i=1; $i<=10; $i++){
         $number = 1;
       for($j=1; $j<=$i; $j++) { 
           echo $number++.' ';
       }
       echo '</br>';
    }
    
    //Триъгълник на Флойд с 21 реда
    for($i=1; $i<=21; $i++){
        $number = 1;
          for($j=1; $j<=$i; $j++) { 
              echo $number++.' ';
          }
          echo '</br>';
       }

    /*Решение с функция
    function FloydTriangles($rows){
           for($i=1; $i<=$rows; $i++){
            $number = 1;
          for($j=1; $j<=$i; $j++) { 
              echo $number++.' ';
          }
          echo '</br>';
       }
    }
    
    FloydTriangles(5);
    
    FloydTriangles(10);
    
    FloydTriangles(21);
    
     */